#!/usr/bin/env python
#-*- coding:utf-8 -*-
# author:Administrator
# datetime:2018/12/3 17:15
# software: PyCharm

# 数据类型-元组练习
#1.创建一个元组，分别进行索引、添加、长度计算、切片操作。
# a=("a","b","c","d","e")
# print(a[2])
#
# print(len(a))
# print(a[1:3])


#2.创建两个元组，进行连接操作。
# a=("a","b","c","d","e")
# b=(1,2,3,4,5,6,7)
# c=a+b
# print(c)

#3.创建一个列表和元组，将其连接后打印出来。
# a=("a", "b", "c", "d", "e")
# b=[1,2,3,4,5,6,7]
# c=a+tuple(b)
# print(c)

# 数据类型-集合练习
# 1.使用花括号和set创建各一个集合。
# a={1,2,3,4,5,6,7}
# b=set(["a","b","c","d","e",1,2,3])


# 2.分别打印出以下集合的值。
# 要求：编写程序之前请自行分析，写出结果后再运行对比，并说明原因。
# s1 = {32, 5,'c','32','11'}
# {32, 5, '11', '32', 'c'}
# print(s1)

# s2 = set({32,'46',32,'aa'})
#{32, 'aa', '46'}
# print(s2)

# s3 = set('4,32,46,11,32')#字符串强转为集合
# {',', '3', '6', '2', '1', '4'}
# print(s3)

# 3.对第1题中的集合进行交、并、差、对称差运算。
# m={1,2,3,4,5,6,7}
# n=set(["a","b","c","d","e",1,2,3])
# a=m&n
# print(a)
#
# b=m|n
# print(b)
#
# c=m-n
# print(c)
#
# d=m^n
# print(d)

# 数据类型-字典练习
# 1.创建一个字典，对其进行访问、添加、连接、修改、清空、删除操作。


# 2.创建一个列表，里面的有两个元素，每个元素是一个字典：
# dic1 = {'name':'zhangsan','age':'20'}
# dic2 = {'name':'lisi','age':'22'}
# 1）对此列表中的第2个元素（字典）中的age修改为23。
# 2）向此列表再添加一个元素,仍然为字典dict3 = {'name':'wang','age':'30'}。
# 3）打印列表中第一个元素的所有键。
# 要求：以上不能直接操作dic，而是操作列表。
# 3.给定一个成绩单（字典），找出最大最小值，并求出平均成绩。成绩自己定义！
# 4.输入一个成绩序列，输出成绩等级的人数。score =
# [45,98,65,87,43,83,68,74,20,75,85,67,79,99]
# 等级A:（90~100）B:(80~89) C:(70~79) D:(60~69) E:(60以下)